{
  "_attn_implementation_autoset": true,
  "abspos_scale": 1e-05,
  "abspos_shift": -90000,
  "age_scale": 0.01,
  "age_shift": -50,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 50281,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "cls",
  "cls_token_id": 1,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "embedding_dropout": 0.1,
  "eos_token_id": 50282,
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 160000.0,
  "hidden_activation": "gelu",
  "hidden_size": 96,
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 64,
  "is_causal": false,
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "max_position_embeddings": 512,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 3,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "reference_compile": null,
  "repad_logits_with_grad": false,
  "sep_token_id": 2,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": true,
  "transformers_version": "4.48.3",
  "type_vocab_size": 1024,
  "vocab_size": 2027
}
